package com.example.myapp.ui

class AboutAndroidManifest {

    /*
    Андроид Манифест - задаёт высоуровневую структура для приложения.
    В ней хранится вся информация о приложения для устройства, и магазинов, распространяющих приложения.
    Содержит в себе всю информацию о приложении, о зависимостях и разрешениях и обо всех програмных компонентах для приложения.
    Есть 4 програмных компонента:
    1) Активити- отвечает за отображение визуальной информации.
    2) BroadcastReceiver - отвечает за получение сообщений.
    3) Service - отвечает за работу с сервисами.
    4) Provider - отвечает за работу с базами данных
    Так же задаются базовые параметры приложения : иконка, название, версия, дата создания, тема, локализация. Интент фильтры для Активтии.



     */
}