package com.example.myapp.ui

class AboutAndroidManifest {

    /*
    Андроид Манифест - задаёт высоуровневую структура для приложения.
    В ней хранится вся информация о приложения для устройства, и магазинов, распространяющих приложения.
    Содержит в себе всю информацию о приложении, о зависимостях и разрешениях и обо всех програмных компонентах для приложения.
    Есть 4 програмных компонента:
    1) Активити- отвечает за отображение визуальной информации.
    2) BroadcastReceiver - отвечает за получение сообщений от приложения и системы .
    3) Service -  Сервисы выполняют долгоживущие операции в фоновом режиме, например, загрузку данных из сети,
     воспроизведение музыки, выполнение синхронизации данных и другие операции, которые могут быть выполнены в фоне,
     без привязки к конкретному пользовательскому интерфейсу.
    4) Provider - Провайдеры используются для управления данными в базах данных приложения или предоставления данных другим приложениям.
    Они предоставляют интерфейс для работы с данными,
     обеспечивая безопасный доступ к данным из различных компонентов приложения или других приложений.
    Так же задаются базовые параметры приложения : иконка, название, версия, дата создания, тема, локализация. Интент фильтры для Активтии.



     */
}